## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_virtual_network.vn will be created
  + resource "azurerm_virtual_network" "vn" {
      + address_space       = [
          + "10.0.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "lorenzo-dev-vn"
      + resource_group_name = "Terraform-workshops"
      + subnet              = (known after apply)
    }

  # null_resource.test will be destroyed
  # (because null_resource.test is not in configuration)
  - resource "null_resource" "test" {
      - id = "4904867679783799214" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>